IDENTIFICATION DIVISION.
PROGRAM-ID. Optellen.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
	FILE-CONTROL.

DATA DIVISION.
FILE SECTION.

WORKING-STORAGE SECTION.
01 NUMMER1 PIC 9(4).
01 NUMMER2 PIC 9(4).
01 RESULTAAT PIC 9(4).

PROCEDURE DIVISION.
	BEGIN.
		DISPLAY "Voer het eerste getal in: ".
		ACCEPT NUMMER1.
		DISPLAY "Voer het tweede getal in: ".
		ACCEPT NUMMER2.
		ADD NUMMER1 TO NUMMER2 GIVING RESULTAAT.
		DISPLAY "Het resultaat van de optelling is: ", RESULTAAT.
		STOP RUN.
	
